Revit 2024 API
FabricSheet.SetUnobscuredInView Method
 Sets this fabric sheet to be shown unobscured in a view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public void SetUnobscuredInView(
	View view,
	bool unobscured
)
Visual Basic
Public Sub SetUnobscuredInView ( _
	view As View, _
	unobscured As Boolean _
)
Visual C++
public:
void SetUnobscuredInView(
	View^ view,
	bool unobscured
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view element
unobscured
Type: System.Boolean
 True if fabric sheet is shown unobscured, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InapplicableDataException |  This fabric sheet doesn't have valid visibility data.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace